###############################################################################
# Created by write_sdc
# Thu May 22 00:41:15 2025
###############################################################################
current_design project4
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name CLK -period 10.0000 [get_ports {CLK}]
set_propagated_clock [get_clocks {CLK}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
