###############################################################################
# Created by write_sdc
# Mon Jun  2 21:58:17 2025
###############################################################################
current_design top_module
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 10.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {core_clock}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
